In [1]:
# Exploratory Data Analysis and preprocessing

In [2]:
'''1. First collect the data 
   2. Understood the data 
       A. Exploring data ( Data acquistion)
       B. Preprocessing and cleaning 
          1. Handle Missing Values 
          2. Handling outlier
          3. handling skewness
          4. handling catogorical Data
          5. Feature Engineering '''

'1. First collect the data \n   2. Understood the data \n       A. Exploring data ( Data acquistion)\n       B. Preprocessing and cleaning \n          1. Handle Missing Values \n          2. Handling outlier\n          3. handling skewness\n          4. handling catogorical Data\n          5. Feature Engineering '

In [3]:
#Prerequisite  : -
'''1. Python knowledge (for loop , list,tuple,dictionary,numpy,pandas,
matplotlib,seaborn  and Descriptive statistics (Mean,median,mode ,std,skew
etc ))'''

'1. Python knowledge (for loop , list,tuple,dictionary,numpy,pandas,\nmatplotlib,seaborn  and Descriptive statistics (Mean,median,mode ,std,skew\netc ))'

In [4]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [5]:
#we create a list
name=["Anu","Deepak","Renu","Asha","Deepti","Kamal"]
math=[78,90,"-",45,"-",69]
science=[57,"?",89,50,70,40]

In [6]:
#We create dictionary with the help of list name,math,science
d={"Name":name,"Math":math,"Science":science}
print(d)

{'Name': ['Anu', 'Deepak', 'Renu', 'Asha', 'Deepti', 'Kamal'], 'Math': [78, 90, '-', 45, '-', 69], 'Science': [57, '?', 89, 50, 70, 40]}

In [7]:
#to change dictionary into DataFrame means 2D array (tabular form)
df=pd.DataFrame(d)
print(df)

     Name Math Science
0     Anu   78      57
1  Deepak   90       ?
2    Renu    -      89
3    Asha   45      50
4  Deepti    -      70
5   Kamal   69      40

In [8]:
#check either null values or not in this dataframe
df.isnull().sum()

Name       0
Math       0
Science    0
dtype: int64

In [9]:
df.isnull()#ignore sum in that case output like this

    Name   Math  Science
0  False  False    False
1  False  False    False
2  False  False    False
3  False  False    False
4  False  False    False
5  False  False    False

In [10]:
df["Name"].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
Name: Name, dtype: bool

In [11]:
df.info()#show all details of datafram

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   Math     6 non-null      object
 2   Science  6 non-null      object
dtypes: object(3)
memory usage: 272.0+ bytes

In [12]:
df["Math"].unique()

array([78, 90, '-', 45, 69], dtype=object)

In [13]:
df["Math"].value_counts()#how many time "-"in col

-     2
45    1
78    1
90    1
69    1
Name: Math, dtype: int64

In [14]:
#null values :  np.nan  to generate null values with numpy 
np.nan

nan

In [15]:
#replace "-" with null values in Math column 
#then use replace () inbuilt function
df["Math"].replace("-",np.nan) #temporary replace

0    78.0
1    90.0
2     NaN
3    45.0
4     NaN
5    69.0
Name: Math, dtype: float64

In [16]:
df #check no replace

     Name Math Science
0     Anu   78      57
1  Deepak   90       ?
2    Renu    -      89
3    Asha   45      50
4  Deepti    -      70
5   Kamal   69      40

In [17]:
#but we want to permanently replace "-" with null values in Math column
#then use inplace=True
df["Math"].replace("-",np.nan,inplace=True)

In [18]:
df

     Name  Math Science
0     Anu  78.0      57
1  Deepak  90.0       ?
2    Renu   NaN      89
3    Asha  45.0      50
4  Deepti   NaN      70
5   Kamal  69.0      40

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   Math     4 non-null      float64
 2   Science  6 non-null      object
dtypes: float64(1), object(2)
memory usage: 272.0+ bytes

In [20]:
df.isnull().sum()

Name       0
Math       2
Science    0
dtype: int64

In [21]:
df["Science"].unique()

array([57, '?', 89, 50, 70, 40], dtype=object)

In [22]:
#How many times "?" in Science column
df["Science"].value_counts()

70    1
?     1
89    1
50    1
57    1
40    1
Name: Science, dtype: int64

In [23]:
#but we want to permanently replace "?" with null values in Science column
#then use inplace=True
df["Science"].replace("?",np.nan,inplace=True)

In [24]:
df

     Name  Math  Science
0     Anu  78.0     57.0
1  Deepak  90.0      NaN
2    Renu   NaN     89.0
3    Asha  45.0     50.0
4  Deepti   NaN     70.0
5   Kamal  69.0     40.0

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   Math     4 non-null      float64
 2   Science  5 non-null      float64
dtypes: float64(2), object(1)
memory usage: 272.0+ bytes

In [26]:
df.isnull().sum()

Name       0
Math       2
Science    1
dtype: int64

In [27]:
df

     Name  Math  Science
0     Anu  78.0     57.0
1  Deepak  90.0      NaN
2    Renu   NaN     89.0
3    Asha  45.0     50.0
4  Deepti   NaN     70.0
5   Kamal  69.0     40.0

In [28]:
#drop null values of  dataframe then use dropna() 
df.dropna()   #by default row wise  delete
#temprary delete row

    Name  Math  Science
0    Anu  78.0     57.0
3   Asha  45.0     50.0
5  Kamal  69.0     40.0

In [29]:
df

     Name  Math  Science
0     Anu  78.0     57.0
1  Deepak  90.0      NaN
2    Renu   NaN     89.0
3    Asha  45.0     50.0
4  Deepti   NaN     70.0
5   Kamal  69.0     40.0

In [33]:
#to delete those column whose null
df.dropna(axis=1)  #bydefault axis=0 if no mension and delete null row
#temporary delete

     Name
0     Anu
1  Deepak
2    Renu
3    Asha
4  Deepti
5   Kamal

In [31]:
#to delete math column whose found null
df.drop("Math",axis=1) #temporary delete

     Name  Science
0     Anu     57.0
1  Deepak      NaN
2    Renu     89.0
3    Asha     50.0
4  Deepti     70.0
5   Kamal     40.0

In [34]:
##to delete math and science column whose found null
#means to delete multiple column then create list
df.drop(["Math","Science"],axis=1) #temporary delete

     Name
0     Anu
1  Deepak
2    Renu
3    Asha
4  Deepti
5   Kamal

In [ ]:
#Dropping null values (All or as your choice according to domain)
#But remember that dropna may not thing the best solution because loss of 
#few data which is very important
#Best solution is fill null values

In [35]:
#Best solution is fill null values 
#Fill null values with zero then use fillna() inbuilt function means
#found null cell and try to fill value which you given
df.fillna(0) #fill 0 with null values but fill temporary

     Name  Math  Science
0     Anu  78.0     57.0
1  Deepak  90.0      0.0
2    Renu   0.0     89.0
3    Asha  45.0     50.0
4  Deepti   0.0     70.0
5   Kamal  69.0     40.0

In [38]:
#fill null values with mean means average in Math column
#find the mean of Math column (numeric column)
m=df["Math"].mean()
s=df["Science"].mean()
print("mean value of math:",m)
df["Math"].fillna(m)#temparary fill
df["Science"].fillna(s)

mean value of math: 70.5

0    57.0
1    61.2
2    89.0
3    50.0
4    70.0
5    40.0
Name: Science, dtype: float64

In [37]:
df

     Name  Math  Science
0     Anu  78.0     57.0
1  Deepak  90.0      NaN
2    Renu   NaN     89.0
3    Asha  45.0     50.0
4  Deepti   NaN     70.0
5   Kamal  69.0     40.0

In [39]:
df["Math"].fillna(m,inplace=True)#permanat
df["Science"].fillna(s,inplace=True)
df

     Name  Math  Science
0     Anu  78.0     57.0
1  Deepak  90.0     61.2
2    Renu  70.5     89.0
3    Asha  45.0     50.0
4  Deepti  70.5     70.0
5   Kamal  69.0     40.0